schreibfaul1/ESP32-MiniWebRadio/src/common.h
        #define I2C_SDA            41  // I2C, dala line for additional HW
        #define I2C_SCL            42  // I2C, clock line for additional HW
#endif

//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// output on serial terminal
#define ANSI_ESC_BLACK      "\033[30m"
#define ANSI_ESC_GREY       "\033[90m"
// #define ANSI_ESC_PINK       "\033[91m"
// #define ANSI_ESC_LIME       "\033[92m"
// #define ANSI_ESC_YELLOW     "\033[93m"
// #define ANSI_ESC_BLUE       "\033[94m"
// #define ANSI_ESC_MAGENTA    "\033[95m"
// #define ANSI_ESC_CYAN       "\033[96m"
// #define ANSI_ESC_WHITE      "\033[97m"
// #define ANSI_ESC_RESET      "\033[0m"
#define ANSI_ESC_RED        "\033[31m"
#define ANSI_ESC_GREEN      "\033[32m"
#define ANSI_ESC_YELLOW     "\033[33m"
#define ANSI_ESC_BLUE       "\033[34m"
#define ANSI_ESC_MAGENTA    "\033[35m"
#define ANSI_ESC_CYAN       "\033[36m"
#define ANSI_ESC_WHITE      "\033[37m"
#define ANSI_ESC_BROWN      "\033[38;5;130m"
#define ANSI_ESC_ORANGE     "\033[38;5;214m"
// #define ANSI_ESC_PURPLE     "\033[38;5;129m"
// #define ANSI_ESC_PINK       "\033[38;5;213m"
// #define ANSI_ESC_LIME       "\033[38;5;190m"
// #define ANSI_ESC_NAVY       "\033[38;5;25m"
// #define ANSI_ESC_VIOLET     "\033[38;5;129m"
// #define ANSI_ESC_AQUA       "\033[38;5;51m"
// #define ANSI_ESC_LAVENDER   "\033[38;5;189m"
// #define ANSI_ESC_DARKGREEN  "\033[38;5;22m"
// #define ANSI_ESC_DARKRED    "\033[38;5;52m"
// #define ANSI_ESC_DARKYELLOW "\033[38;5;214m"
// #define ANSI_ESC_DARKBLUE   "\033[38;5;17m"
// #define ANSI_ESC_DARKMAGENTA "\033[38;5;53m"
// #define ANSI_ESC_DARKCYAN   "\033[38;5;23m"
// #define ANSI_ESC_DARKWHITE  "\033[38;5;188m"

#define ANSI_ESC_RESET      "\033[0m"
#define ANSI_ESC_BOLD       "\033[1m"
#define ANSI_ESC_FAINT      "\033[2m"
#define ANSI_ESC_ITALIC     "\033[3m"
#define ANSI_ESC_UNDERLINE  "\033[4m"
#define ANSI_ESC_BLINK      "\033[5m"
#define ANSI_ESC_INVERT     "\033[7m"
#define ANSI_ESC_STRIKE     "\033[9m"

//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
static bool _newLine = false;
extern SemaphoreHandle_t mutex_rtc;
extern RTIME rtc;
#define SerialPrintfln(...) {xSemaphoreTake(mutex_rtc, portMAX_DELAY); \
 /* line feed */            if(_newLine){_newLine = false; Serial.println("");} \
                            rtc.hasValidTime()? Serial.printf("%s ", rtc.gettime_s()) : Serial.printf("00:00:00 "); \
                            Serial.printf(__VA_ARGS__); \
                            Serial.printf("\033[0m"); \
                            Serial.println(""); \
                            xSemaphoreGive(mutex_rtc);}

#define SerialPrintfcr(...) {xSemaphoreTake(mutex_rtc, portMAX_DELAY); \
 /* carriage return */      rtc.hasValidTime()? Serial.printf("%s ", rtc.gettime_s()) : Serial.printf("00:00:00 "); \
                            Serial.printf(__VA_ARGS__); \
                            Serial.printf("\033[0m"); \
                            Serial.print("  \r"); \
                            _newLine = true; \
                            xSemaphoreGive(mutex_rtc);}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
struct dlnaHistory {
    char*  objId = NULL;
    char*   name = NULL;
};
struct releasedArg {
    char*   arg1 = NULL;
    char*   arg2 = NULL;
    int16_t val1 = 0;
    int16_t val2 = 0;
};
struct timecounter {
    uint8_t timer = 0;
    uint8_t factor = 2;
};
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

// clang-format on
//prototypes (main.cpp)
boolean        defaultsettings();
boolean        saveDefaultIRbuttonsToNVS();
void           saveIRbuttonsToNVS();
void           loadIRbuttonsFromNVS();
void           updateSettings();
void           urldecode(char* str);
const char*    SD_stringifyDirContent(String path);
void           setTFTbrightness(uint8_t duty);
void           fall_asleep();
void           wake_up();
void           setRTC(const char* TZString);
boolean        copySDtoFFat(const char* path);
void           display_info(const char* str, int32_t xPos, int32_t yPos, uint16_t color, uint16_t margin_l, uint16_t margin_r, uint16_t winWidth, uint16_t winHeight);
void           showStreamTitle(const char* streamTitle);
void           showLogoAndStationName(bool force);
void           showFileLogo(uint8_t state);
void           showFileName(const char* fname);
void           showPlsFileNumber();
void           showAudioFileNumber();
void           display_sleeptime(int8_t ud = 0);
boolean        drawImage(const char* path, uint16_t posX, uint16_t posY, uint16_t maxWidth = 0, uint16_t maxHeigth = 0);
boolean        isAudio(File file);
boolean        isAudio(const char* path);
boolean        isPlaylist(File file);
bool           connectToWiFi();
void           openAccessPoint();
const char*    scaleImage(const char* path);
void           setVolume(uint8_t vol);
uint8_t        downvolume();
uint8_t        upvolume();
void           setStation(uint16_t sta);
void           nextStation();
void           prevStation();
void           setStationByNumber(uint16_t staNr);
void           StationsItems();
void           setStationViaURL(const char* url);
void           savefile(const char* fileName, uint32_t contentLength);
String         setI2STone();
void           SD_playFile(const char* path, const char* fileName);
void           SD_playFile(const char* path, uint32_t resumeFilePos = 0, bool showFN = true);
bool           SD_rename(const char* src, const char* dest);
bool           SD_newFolder(const char* folderPathName);
bool           SD_delete(const char* itemPath);
bool           preparePlaylistFromDLNAFolder();
bool           preparePlaylistFromFile(const char* path);
bool           preparePlaylistFromSDFolder(const char* path);
void           sortPlayListAlphabetical();
void           sortPlayListRandom();
void           processPlaylist(boolean first = false);
void           changeState(int32_t state);
void           connecttohost(const char* host);
void           connecttoFS(const char* filename, uint32_t resumeFilePos = 0);
void           stopSong();
void IRAM_ATTR headphoneDetect();
void           placingGraphicObjects();
void           muteChanged(bool m);
void           BTpowerChanged(int8_t newState); // true -> power on, false -> power off
void           setTimeCounter(uint8_t sec);


//prototypes (audiotask.cpp)
void           audioInit();
void           audioControlTaskDelete();
void           audioSetVolume(uint8_t vol, uint8_t curve);
void           audioSetVolumeSteps(uint8_t steps);
uint8_t        audioGetVolume();
uint32_t       audioGetBitRate();
boolean        audioConnecttohost(const char* host, const char* user = "", const char* pwd = "");
boolean        audioConnecttoFS(const char* filename, uint32_t resumeFilePos = 0);
boolean        audioConnecttospeech(const char* text, const char* lang);
uint32_t       audioStopSong();
void           audioSetTone(int8_t param0, int8_t param1, int8_t param2, int8_t param3);
uint32_t       audioInbuffFilled();
uint32_t       audioInbuffFree();
uint32_t       audioInbuffSize();
boolean        audioIsRunning();
uint32_t       audioGetStackHighWatermark();
uint32_t       audioGetCodec();
boolean        audioPauseResume();
void           audioConnectionTimeout(uint32_t timeout_ms, uint32_t timeout_ms_ssl);
uint32_t       audioGetFileSize();
uint32_t       audioGetFilePosition();
uint16_t       audioGetVUlevel();
uint32_t       audioGetFileDuration();
uint32_t       audioGetCurrentTime();
bool           audioSetTimeOffset(int16_t timeOffset);
void           audioSetCoreID(uint8_t coreId);

//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline const char* byte_to_binary(int8_t x) { // e.g. alarmdays
    static char b[9];
    b[0] = '\0';

