schreibfaul1/ESP32-MiniWebRadio/src/common.h
inline int32_t map_l(int32_t x, int32_t in_min, int32_t in_max, int32_t out_min, int32_t out_max) {
    const int32_t run = in_max - in_min;
    if(run == 0) {
        log_e("map(): Invalid input range, %i == %i (min == max)", in_min, in_max);
        return -1; // AVR returns -1, SAM returns 0
    }
    const int32_t rise = out_max - out_min;
    const int32_t delta = x - in_min;
    return round((delta * rise) / run + out_min);
}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline void SerialPrintflnCut(const char* item, const char* color, const char* str) {
    uint8_t maxLength = 100;
    if(strlen(str) > maxLength) {
        String f = str;
        SerialPrintfln("%s%s%s ... %s", item, color, f.substring(0, maxLength - 25).c_str(), f.substring(f.length() - 20, f.length()).c_str());
    }
    else { SerialPrintfln("%s%s%s", item, color, str); }
}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
extern TFT tft;
inline void hardcopy(){
    const uint8_t bmp320x240[70] = {
        0x42, 0x4D, 0x46, 0x58, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x46, 0x00, 0x00, 0x00, 0x38, 0x00, 0x00, 0x00, 0x40, 0x01, 0x00, 0x00, 0xF0, 0x00,
        0x00, 0x00, 0x01, 0x00, 0x10, 0x00, 0x03, 0x00, 0x00, 0x00, 0x00, 0x58, 0x02, 0x00, 0x23, 0x2E, 0x00, 0x00, 0x23, 0x2E, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0xF8, 0x00, 0x00, 0xE0, 0x07, 0x00, 0x00, 0x1F, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    };
    const uint8_t bmp480x320[70] = {
        0x42, 0x4D, 0x46, 0xB0, 0x04, 0x00, 0x00, 0x00, 0x00, 0x00, 0x46, 0x00, 0x00, 0x00, 0x38, 0x00, 0x00, 0x00, 0xE0, 0x01, 0x00, 0x00, 0x40, 0x01,
        0x00, 0x00, 0x01, 0x00, 0x10, 0x00, 0x03, 0x00, 0x00, 0x00, 0x00, 0xB0, 0x04, 0x00, 0x23, 0x2E, 0x00, 0x00, 0x23, 0x2E, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0xF8, 0x00, 0x00, 0xE0, 0x07, 0x00, 0x00, 0x1F, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    };
    File hc = SD_MMC.open("/hardcopy.bmp", "w", true);
    if(TFT_CONTROLLER < 2){
        hc.write(bmp320x240, sizeof(bmp320x240));
        uint16_t buff[320];
        for(int i = 240; i > 0; i--){
            tft.readRect(0, i - 1, 320, 1, buff);
            hc.write((uint8_t*)buff, 320 * 2);
        }
        hc.close();
    }
    else{
        hc.write(bmp480x320, sizeof(bmp480x320));
        uint16_t buff[480];
        for(int i = 320; i > 0; i--){
            tft.readRect(0, i - 1, 480, 1, buff);
            hc.write((uint8_t*)buff, 480 * 2);
        }
        hc.close();
    }
}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
inline void vector_clear_and_shrink(vector<char*>& vec) {
    uint size = vec.size();
    for(int32_t i = 0; i < size; i++) {
        if(vec[i]) {
            free(vec[i]);
            vec[i] = NULL;
        }
    }
    vec.clear();
    vec.shrink_to_fit();
}
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class SD_content{
private:
    std::vector<char*>  m_SD_content;
    File m_masterFile;
    File m_slaveFile;
    char* m_buff = NULL;
public:
    SD_content(){
        vector_clear_and_shrink(m_SD_content);
    }
    ~SD_content(){
        vector_clear_and_shrink(m_SD_content);
        if(m_buff){free(m_buff); m_buff = NULL;}
    }
    bool listDir(const char* path, boolean audioFilesOnly, boolean withoutDirs){
        m_buff = x_ps_malloc(1024);
        if(!m_buff) {log_e("oom"); return false;}
        vector_clear_and_shrink(m_SD_content);
        if(m_masterFile) m_masterFile.close();
        if(!SD_MMC.exists(path)) {
            SerialPrintfln(ANSI_ESC_RED "SD_MMC/%s not exist", path);
            return false;
        }
        m_masterFile = SD_MMC.open(path);
        if(!m_masterFile.isDirectory()) {
            SerialPrintfln(ANSI_ESC_RED "SD_MMC/%s is not a directory", path);
            m_masterFile.close();
            return false;
        }
        while(true) { // get content
            m_slaveFile = m_masterFile.openNextFile();
            if(!m_slaveFile) break;
            if(m_slaveFile.isDirectory()) {
                if(!withoutDirs) {
                    m_buff[0] = 2; // ASCII: start of text, sort set dirs on first position
                    sprintf(m_buff + 1, "%s", m_slaveFile.name());
                    m_SD_content.push_back(x_ps_strdup((const char*)m_buff));
                }
            }
            else {
                if(audioFilesOnly) {
                    if(endsWith(m_slaveFile.name(), ".mp3") || endsWith(m_slaveFile.name(), ".aac") || endsWith(m_slaveFile.name(), ".m4a") || endsWith(m_slaveFile.name(), ".wav") || endsWith(m_slaveFile.name(), ".flac") ||
                       endsWith(m_slaveFile.name(), ".m3u") || endsWith(m_slaveFile.name(), ".opus") || endsWith(m_slaveFile.name(), ".ogg")) {
                        sprintf(m_buff, "%s" ANSI_ESC_YELLOW " %d", m_slaveFile.name(), m_slaveFile.size());
                        m_SD_content.push_back(x_ps_strdup((const char*)m_buff));
                    }
                }
                else {
                    sprintf(m_buff, "%s" ANSI_ESC_YELLOW " %d", m_slaveFile.name(), m_slaveFile.size());
                    m_SD_content.push_back(x_ps_strdup((const char*)m_buff));
                }
            }
        }
        for(int i = 0; i < m_SD_content.size(); i++) { // easy bubble sort
            for(int j = 1; j < m_SD_content.size(); j++) {
                if(strcmp(m_SD_content[j - 1], m_SD_content[i]) > 0) { swap(m_SD_content[i], m_SD_content[j - 1]); }
            }
        }
        for(int i = 0; i < m_SD_content.size(); i++) {
            if(m_SD_content[i][0] == 2) { // remove ASCII 2
                memcpy(m_SD_content[i], m_SD_content[i] + 1, strlen(m_SD_content[i]));
            }
        }
        m_masterFile.close();
        if(m_buff){free(m_buff); m_buff = NULL;}
        return true;
    }
    size_t getSize(){
        return m_SD_content.size();
    }
    const char* getIndex(uint16_t idx){
        return m_SD_content[idx];
    }
    uint16_t getNextAudioFile(uint16_t currIdx){ // assume listDir with "audioFilesOnly"
        if(m_SD_content.size() == 0) return 0;
        if(currIdx >= m_SD_content.size()) currIdx = m_SD_content.size() -1;
        int16_t newIdx = currIdx;
        while(true){
            newIdx++;
            if(newIdx >= m_SD_content.size()) newIdx = 0;
            if(newIdx == currIdx) break; // avoid an infinite loop
            if(indexOf(m_SD_content[newIdx], ".m3u", 0) == -1 ) break; // skip m3u files
        }
        return newIdx;
    }

    uint16_t getPrevAudioFile(uint16_t currIdx){ // assume listDir with "audioFilesOnly"
        if(m_SD_content.size() == 0) return 0;
        if(currIdx >= m_SD_content.size()) currIdx = m_SD_content.size() -1;
        int16_t newIdx = currIdx;
        while(true){
            newIdx--;
            if(newIdx == -1) newIdx = m_SD_content.size() - 1;
            if(newIdx == currIdx) break; // avoid an infinite loop
            if(indexOf(m_SD_content[newIdx], ".m3u", 0) == -1 ) break; // skip m3u files
        }
        return newIdx;
    }

